**Terraform Format and Style 🖌**
`success`

**Terraform Initialization ⚙️**
`success`

**Terraform Plan 📖**
`success`

<details><summary>Show Plan</summary>
```
terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

hcloud_ssh_key.default: Refreshing state... [id=2415045]
hcloud_network.internal: Refreshing state... [id=389204]
hcloud_floating_ip.bastion: Refreshing state... [id=369139]
data.hcloud_image.base: Refreshing state...
hcloud_server.bastion: Refreshing state... [id=8683688]
hcloud_network_subnet.internal: Refreshing state... [id=389204-10.0.0.0/24]
hcloud_floating_ip_assignment.bastion: Refreshing state... [id=369139]
hcloud_server_network.bastion: Refreshing state... [id=8683688-389204]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # hcloud_floating_ip_assignment.bastion must be replaced
-/+ resource "hcloud_floating_ip_assignment" "bastion" {
        floating_ip_id = 369139
      ~ id             = "369139" -> (known after apply)
      ~ server_id      = 8683688 -> (known after apply) # forces replacement
    }

  # hcloud_server.bastion must be replaced
-/+ resource "hcloud_server" "bastion" {
      + backup_window = (known after apply)
        backups       = false
      ~ datacenter    = "fsn1-dc14" -> (known after apply)
      ~ id            = "8683688" -> (known after apply)
      ~ image         = "26585483" -> "26591051" # forces replacement
      ~ ipv4_address  = "168.119.153.222" -> (known after apply)
      ~ ipv6_address  = "2a01:4f8:c17:52fa::1" -> (known after apply)
      ~ ipv6_network  = "2a01:4f8:c17:52fa::/64" -> (known after apply)
        keep_disk     = false
      - labels        = {} -> null
        location      = "fsn1"
      ~ name          = "bastion" -> "bastion.mhnet.me"
        server_type   = "cx11"
        ssh_keys      = [
            "2415045",
        ]
      ~ status        = "running" -> (known after apply)
      ~ user_data     = "kSkzULUy0yIJBoMs3HvreDXHx8s=" -> "5VSDHLjjvq6u84bgOaQNPezFwzc=" # forces replacement
    }

  # hcloud_server_network.bastion must be replaced
-/+ resource "hcloud_server_network" "bastion" {
      - alias_ips   = [] -> null
      ~ id          = "8683688-389204" -> (known after apply)
      ~ ip          = "10.0.0.2" -> (known after apply)
      ~ mac_address = "86:00:00:80:52:89" -> (known after apply)
        network_id  = 389204
      ~ server_id   = 8683688 -> (known after apply) # forces replacement
    }

Plan: 3 to add, 0 to change, 3 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```
</details>
Pusher: @mhutter
Action: `pull_request`